# Course 1 Week 2 Quiz 2

## Q1: or the following code, which of the following statements will not return True?

In [1]:
import pandas as pd
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

##### Trying to look at the objects

In [4]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [5]:
obj2
# this is because there is no "California" in the first place

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [6]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

##### The choices:

In [7]:
import math
math.isnan(obj2['California'])

True

In [8]:
obj3['California']

True

In [15]:
x = obj2['California']
obj2['California'] != x ##### important to remember

True

In [12]:
obj2['California'] == None # == nan

False

## Q2: In the above python code, the keys of the dictionary d represent student ranks and the value for each key is a student name. Which of the following can be used to extract rows with student ranks that are lower than or equal to 3?

In [18]:
import pandas as pd
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)

In [38]:
S.iloc[:3]

1    Alice
2      Bob
3     Rita
dtype: object

## Q3: Suppose we have a DataFrame named df. We want to change the original DataFrame df in a way that all the column names are cast to upper case. Which of the following expressions is incorrect to perform the same?

Options

- df = df.rename(mapper = lambda x: x.upper(), axis = 'column') # this is so obvious; wrong syntax
- df = df.rename(mapper = lambda x: x.upper(), axis = 1)
- df.rename(mapper = lambda x: x.upper(), axis = 1, inplace = True)
- df.rename(mapper = lambda x: x.upper(), axis = 1)

In [46]:
dfr = pd.read_csv("C1W2/class_grades.csv")
df = dfr.copy()

In [47]:
# my preferred method
cols = [i.upper().strip() for i in list(df.columns)]
df.columns = cols
print(df.columns)

Index(['PREFIX', 'ASSIGNMENT', 'TUTORIAL', 'MIDTERM', 'TAKEHOME', 'FINAL'], dtype='object')

In [49]:
# Wrong syntax
# df = dfr.rename(mapper = lambda x: x.upper(), axis = 'column')

## Q4: For the given DataFrame df we want to keep only the records with a toefl score greater than 105. Which of the following will not work?

In [2]:
import pandas as pd
df = pd.DataFrame()

In [3]:
df["gre"] = [337,324,316,322,314]

In [4]:
df["toefl"] = [118,107,104,110,103]

In [5]:
df

   gre  toefl
0  337    118
1  324    107
2  316    104
3  322    110
4  314    103

Options:

- df[df['toefl score'] > 105]
- df.where(df['toefl score'] > 105)
- df.where(df['toefl score'] > 105).dropna()

In [6]:
df[df["toefl"]>105]

   gre  toefl
0  337    118
1  324    107
3  322    110

In [9]:
df.where(df["toefl"]>105)

     gre  toefl
0  337.0  118.0
1  324.0  107.0
2    NaN    NaN
3  322.0  110.0
4    NaN    NaN

In [11]:
df.where(df["toefl"]>105).dropna()

     gre  toefl
0  337.0  118.0
1  324.0  107.0
3  322.0  110.0

## Q5: Which of the following can be used to create a DataFrame in Pandas?

Options: 

- All of these work
- Python dict
- 2D ndarray
- Pandas Series object

## Q6: Which of the following is an incorrect way to drop entries from the Pandas DataFrame named df shown below?

In [12]:
# dropping columns v.s. dropping row

In [15]:
dfc = df.copy()
dfc

   gre  toefl
0  337    118
1  324    107
2  316    104
3  322    110
4  314    103

In [18]:
dfc.drop(1) # dropping the rows by default (axis = 0)

   gre  toefl
0  337    118
2  316    104
3  322    110
4  314    103

In [19]:
dfc.drop("gre",axis = 1) # need to specify axis = 1

   toefl
0    118
1    107
2    104
3    110
4    103

## Q7: For the Series s1 and s2 defined below, which of the following statements will give an error?

In [22]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [25]:
# obviously s2.loc[1]

##### exploring the functions

In [26]:
s1.loc[1]

'Alice'

In [27]:
s1[1] # giving s1.loc[1] as the key is integers

'Alice'

In [28]:
s2[1] # giving the value of index 1

2

In [29]:
s2.iloc[1] # same as s2[1]

2

## Q8: Which of the following statements is incorrect?

- We can use s.iteritems() on a pd.Series object s to iterate on it.
- If s is a pd.Series object, then we can use s.loc[label] to get all data where the index is equal to label.
- If s and s1 are two pd.Series objects, we cannot use s.append(s1) to directly append s1 to the existing series s
- loc and iloc are two useful and commonly used Pandas methods.

In [33]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = {1: 'Alice', 2: 'Jack', 3: 'Molly'}

In [32]:
# first point
for i,j in s1.iteritems():
    print(i,j)

1 Alice
2 Jack
3 Molly

In [35]:
# we can do the same for dict() items
for i,j in s2.items():
    print(i,j)

1 Alice
2 Jack
3 Molly

In [36]:
# second point
s1.loc[2]

'Jack'

In [37]:
# third point
s3 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})
s3.append(s1)

Alice        1
Jack         2
Molly        3
1        Alice
2         Jack
3        Molly
dtype: object

In [0]:
# fourth point
# of course it is very useful

## Q9: For the given DataFrame df shown above, we want to get all records with a toefl score greater than 105 but smaller than 115. Which of the following expressions is incorrect to perform the same?

In [11]:
dfc = df.copy()
dfc

   gre  toefl
0  337    118
1  324    107
2  316    104
3  322    110
4  314    103

Options:
    

- df[(df['toefl score'].isin(range(106, 115)))]
- df[(df['toefl score'] > 105) & (df['toefl score'] < 115)]
- df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]
- (df['toefl score'] > 105) & (df['toefl score'] < 115) # this is obviously the mask

In [12]:
# Usual way

mask = (df["toefl"] > 105) & (df["toefl"] < 115)
dfc[mask]

   gre  toefl
1  324    107
3  322    110

In [14]:
# Other ways

df[(df['toefl'].isin(range(106, 115)))]

   gre  toefl
1  324    107
3  322    110

In [15]:
df[df['toefl'].gt(105) & df['toefl'].lt(115)]

   gre  toefl
1  324    107
3  322    110

## Q10: extracting rows from a dataframe

In [24]:
df

   gre  toefl
0  337    118
1  324    107
2  316    104
3  322    110
4  314    103

In [26]:
# first method:

df.loc[2]

gre      316
toefl    104
Name: 2, dtype: int64

In [27]:
# second method:

df.T[2]

gre      316
toefl    104
Name: 2, dtype: int64